app/controllers/autoservices_controller.rb

SELECT "services".* FROM "services"
---
  def index
    @autoservices = Service.all

INSERT INTO "autos" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-02-13 15:31:53.114994"], ["updated_at", "2018-02-13 15:31:53.114994"]]
INSERT INTO "services" ("name", "city", "address", "diler", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Вернісаж"], ["city", "Дрогобич "], ["address", "Дрогобицька 6"], ["diler", "f"], ["created_at", "2018-02-17 17:25:14.014169"], ["updated_at", "2018-02-17 17:25:14.014169"]]
---
  def create
    @autoservice = Service.new(autoservice_params)
    if @autoservice.valid?
      @autoservice.save

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @autoservice = Service.find(params[:id])

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "services" SET "name" = $1, "city" = $2, "address" = $3, "diler" = $4, "updated_at" = $5 WHERE "services"."id" = $6  [["name", "Шипшина"], ["city", "Львів"], ["address", "Стрийська 25"], ["diler", "t"], ["updated_at", "2018-02-17 18:21:01.919000"], ["id", 11]]
---
  def update
    @autoservice = Service.find(params[:id])
    if @autoservice.update(autoservice_params)

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 17]]
---
  def destroy
    autoservice = Service.find(params[:id])
    autoservice.destroy