app/controllers/brands_controller.rb

SELECT "brands"."id" FROM "brands"
---
  def index
    @brands = Brand.all

INSERT INTO "brands" ("brand", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["brand", "nnh"], ["created_at", "2018-02-16 16:27:07.235415"], ["updated_at", "2018-02-16 16:27:07.235415"]]
---
  def create
    @brand = Brand.new(brand_params)
    @brand.save

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @brand = Brand.find(params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "brands" SET "brand" = $1, "updated_at" = $2 WHERE "brands"."id" = $3  [["brand", "Honda"], ["updated_at", "2018-02-16 16:52:40.177591"], ["id", 8]]
---
  def update
    @brand = Brand.find(params[:id])
    if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 1]]
---
  def destroy
    @brand = Brand.find(params[:id])
    @brand.destroy