app/controllers/cars_controller.rb

  def new
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"

  def create
    @auto = Car.new(auto_params)
      @auto.save
---
INSERT INTO "autos" ("marka", "model", "autoYear", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["marka", "dd"], ["model", "ss"], ["autoYear", "aa"], ["created_at", "2018-02-13 15:42:52.962819"], ["updated_at", "2018-02-13 15:42:52.962819"]]
INSERT INTO "cars" ("id_brand", "model", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_brand", 4], ["model", "dddfff"], ["created_at", "2018-02-16 17:40:49.856741"], ["updated_at", "2018-02-16 17:40:49.856741"]]

  def destroy
    car = Car.find(params[:id_brand])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 5654], ["LIMIT", 1]]