app/controllers/services_controller.rb

SELECT  "autos".* FROM "autos" ORDER BY "autos"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def new
    @marka_car = Auto.find_by_sql("SELECT id, marka
      FROM autos  ORDER BY marka ASC")
    @cars = Auto.all